visionspacetec/VST104-Testing/VST104-Testing/VST104-Testing.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32L4
VP_RCC_LSE.Signal=RCC_LSE
ProjectManager.MainLocation=Core/Src
I2C2.IPParameters=Timing
VP_RCC_LSE.Mode=CRS SYNC Source LSE
PA6.Mode=Full_Duplex_Master
RCC.USART1Freq_Value=52000000
PA14\ (JTCK/SWCLK).GPIOParameters=GPIO_Label
RCC.SAI1Freq_Value=52000000
RCC.CortexFreq_Value=52000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32L496ZGTx
SPI1.VirtualType=VM_MASTER
ADC2.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PH0-OSC_IN\ (PH0).Locked=true
CAN2.CalculateTimeBit=1538.46
RCC.PLLSAI1RoutputFreq_Value=52000000
I2C2.Timing=0x00C0FEFF
PA0.GPIO_Label=QSPI_CS1
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_ADC1_Init-ADC1-false-HAL-true,4-MX_CAN1_Init-CAN1-false-HAL-true,5-MX_CAN2_Init-CAN2-false-HAL-true,6-MX_I2C2_Init-I2C2-false-HAL-true,7-MX_QUADSPI_Init-QUADSPI-false-HAL-true,8-MX_SPI1_Init-SPI1-false-HAL-true
PC0.GPIOParameters=GPIO_PuPd,GPIO_Label
PC0.GPIO_Label=SPI1_HOLD
PC3.Locked=true
PA3.GPIOParameters=GPIO_Label
RCC.USART2Freq_Value=52000000
PC15-OSC32_OUT\ (PC15).Mode=LSE-External-Oscillator
PC1.Locked=true
PB3\ (JTDO/TRACESWO).GPIOParameters=GPIO_Label
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=52000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
PC14-OSC32_IN\ (PC14).Mode=LSE-External-Oscillator
RCC.LPTIM1Freq_Value=52000000
RCC.I2C3Freq_Value=52000000
Mcu.IP4=I2C2
Mcu.IP5=NVIC
RCC.FCLKCortexFreq_Value=52000000
Mcu.IP2=CAN1
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=CAN2
Mcu.IP0=ADC1
PA14\ (JTCK/SWCLK).Signal=SYS_JTCK-SWCLK
Mcu.IP1=ADC2
PC15-OSC32_OUT\ (PC15).GPIOParameters=GPIO_Label
SPI1.CLKPolarity=SPI_POLARITY_LOW
PF9.Locked=true
Mcu.UserConstants=
RCC.VCOSAI1OutputFreq_Value=104000000
PF7.Signal=QUADSPI_BK1_IO2
PC1.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.SDMMCFreq_Value=52000000
Mcu.ThirdPartyNb=0
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=52000000
RCC.I2C4Freq_Value=52000000
SH.ADCx_IN3.0=ADC2_IN3,IN3-Single-Ended
Mcu.IPNb=10
ProjectManager.PreviousToolchain=
PF1.Locked=true
RCC.APB2TimFreq_Value=52000000
PB6.Signal=CAN2_TX
SH.ADCx_IN3.ConfNb=1
PB6.Mode=CAN_Activate
SPI1.CalculateBaudRate=26.0 MBits/s
PC3.Signal=ADCx_IN4
Mcu.Pin6=PF8
RCC.SAI2Freq_Value=52000000
Mcu.Pin7=PF9
Mcu.Pin8=PF10
Mcu.Pin9=PH0-OSC_IN (PH0)
QUADSPI.FlashSize=31
RCC.AHBFreq_Value=52000000
Mcu.Pin0=PC14-OSC32_IN (PC14)
Mcu.Pin1=PC15-OSC32_OUT (PC15)
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PF0
Mcu.Pin3=PF1
RCC.USART3Freq_Value=52000000
Mcu.Pin4=PF6
Mcu.Pin5=PF7
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=26000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA0.Locked=true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.Locked=true
PC1.GPIO_PuPd=GPIO_PULLUP
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.FirmwarePackage=STM32Cube FW_L4 V1.17.0
MxDb.Version=DB.6.0.20
PA13\ (JTMS/SWDIO).GPIO_Label=SW_DIO
PF9.Mode=Single Bank 1
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=13000000
PC4.GPIO_Label=SPI1_CS1
PB5.Mode=CAN_Activate
SPI1.DataSize=SPI_DATASIZE_8BIT
File.Version=6
PF10.Locked=true
PF8.Mode=Single Bank 1
PB8.Locked=true
PA14\ (JTCK/SWCLK).Mode=Trace_Asynchronous_SW
RCC.PLLRCLKFreq_Value=52000000
SH.ADCx_IN4.ConfNb=2
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13\ (JTMS/SWDIO).Locked=true
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=VST104-Testing
PA0.Signal=GPIO_Output
PD7.GPIO_Label=I2C2_EN
Mcu.Package=LQFP144
PB9.Signal=CAN1_TX
PA6.Signal=SPI1_MISO
PA5.Locked=true
PA7.Locked=true
CAN2.BS1=CAN_BS1_2TQ
CAN2.BS2=CAN_BS2_2TQ
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=QSPI_CS3
PA14\ (JTCK/SWCLK).Locked=true
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
ADC2.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_3
RCC.LSCOPinFreq_Value=32000
PF8.Signal=QUADSPI_BK1_IO0
ADC1.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_NONE
RCC.DFSDMFreq_Value=52000000
PF7.Locked=true
PC14-OSC32_IN\ (PC14).Locked=true
PA14\ (JTCK/SWCLK).GPIO_Label=SW_CLK
RCC.PLLPoutputFreq_Value=52000000
RCC.APB1TimFreq_Value=52000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC4.Locked=true
RCC.LPUART1Freq_Value=52000000
PF10.Mode=Single Bank 1
PF0.Signal=I2C2_SDA
PC0.GPIO_PuPd=GPIO_PULLUP
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_2
CAN1.CalculateTimeBit=1538.46
PH0-OSC_IN\ (PH0).Mode=HSE-External-Clock-Source
PA4.GPIO_Label=SPI1_CS2
PC2.GPIO_Label=EF2_CUR
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
RCC.HSI48_VALUE=48000000
PA3.Signal=GPIO_Output
CAN1.CalculateTimeQuantum=307.6923076923077
PA5.Mode=Full_Duplex_Master
PH1-OSC_OUT\ (PH1).GPIO_Label=OSC_EN
PA2.Locked=true
PB3\ (JTDO/TRACESWO).GPIO_Label=SW_0
RCC.MSI_VALUE=4000000
ADC2.ClockPrescaler=ADC_CLOCK_ASYNC_DIV4
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
CAN2.CalculateBaudRate=650000
RCC.PLLQoutputFreq_Value=52000000
ProjectManager.ProjectFileName=VST104-Testing.ioc
PC15-OSC32_OUT\ (PC15).GPIO_Label=OSC32_OUT
PA7.Mode=Full_Duplex_Master
PA13\ (JTMS/SWDIO).Mode=Trace_Asynchronous_SW
Mcu.PinsNb=34
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler,DataSize,CLKPolarity
ADC1.IPParameters=Rank-1\#ChannelRegularConversion,master,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,OffsetNumber-1\#ChannelRegularConversion,NbrOfConversionFlag,ClockPrescaler
CAN1.IPParameters=CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate,BS1,BS2
RCC.SWPMI1Freq_Value=52000000
CAN1.CalculateBaudRate=650000
CAN2.IPParameters=CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate,BS1,BS2
PC2.Signal=ADCx_IN3
PC4.Signal=GPIO_Output
PD7.Signal=GPIO_Output
ProjectManager.DefaultFWLocation=true
PC15-OSC32_OUT\ (PC15).Signal=RCC_OSC32_OUT
ProjectManager.DeletePrevious=true
PC0.Signal=GPIO_Output
RCC.VCOSAI2OutputFreq_Value=104000000
PA13\ (JTMS/SWDIO).GPIOParameters=GPIO_Label
QUADSPI.IPParameters=FlashSize
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=GPIO_Output
PC14-OSC32_IN\ (PC14).GPIO_Label=OSC32_IN
PC3.GPIOParameters=GPIO_Label
PF7.Mode=Single Bank 1
PF1.Mode=I2C
PH1-OSC_OUT\ (PH1).GPIOParameters=GPIO_Label
CAN1.BS2=CAN_BS2_2TQ
PF6.Signal=QUADSPI_BK1_IO3
PB3\ (JTDO/TRACESWO).Locked=true
PB3\ (JTDO/TRACESWO).Signal=SYS_JTDO-SWO
CAN1.BS1=CAN_BS1_2TQ
ProjectManager.TargetToolchain=STM32CubeIDE
PF6.Locked=true
ADC2.IPParameters=Rank-1\#ChannelRegularConversion,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,OffsetNumber-1\#ChannelRegularConversion,NbrOfConversionFlag,ClockPrescaler
PB9.Mode=CAN_Activate
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_4
PB5.Locked=true
PB9.Locked=true
PC2.Locked=true
ProjectManager.RegisterCallBack=
PC15-OSC32_OUT\ (PC15).Locked=true
RCC.USBFreq_Value=52000000
PD7.Locked=true
PA1.Signal=GPIO_Output
RCC.PLLSAI1PoutputFreq_Value=52000000
ADC2.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_NONE
RCC.PLLSAI2RoutputFreq_Value=52000000
PA5.Signal=SPI1_SCK
PH1-OSC_OUT\ (PH1).Locked=true
board=custom
RCC.VCOOutputFreq_Value=104000000
ProjectManager.LastFirmware=true
RCC.APB2Freq_Value=52000000
RCC.UART4Freq_Value=52000000
MxCube.Version=6.2.0
RCC.I2C1Freq_Value=52000000
SPI1.Mode=SPI_MODE_MASTER
PF10.Signal=QUADSPI_CLK
RCC.RNGFreq_Value=52000000
PC2.GPIOParameters=GPIO_Label
SH.ADCx_IN4.1=ADC2_IN4
RCC.PLLSAI1QoutputFreq_Value=52000000
Mcu.Pin30=PB8
RCC.ADCFreq_Value=52000000
PC1.GPIO_Label=SP1_WP
PA1.GPIO_Label=QSPI_CS2
VP_SYS_VS_Systick.Mode=SysTick
CAN2.CalculateTimeQuantum=307.6923076923077
Mcu.Pin33=VP_SYS_VS_Systick
Mcu.Pin31=PB9
SH.ADCx_IN4.0=ADC1_IN4,IN4-Single-Ended
Mcu.Pin32=VP_RCC_LSE
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
PF0.Locked=true
PF1.Signal=I2C2_SCL
RCC.UART5Freq_Value=52000000
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,DFSDMFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSI_VALUE,MCO1PinFreq_Value,MSI_VALUE,PLLM,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSAI1PoutputFreq_Value,PLLSAI1QoutputFreq_Value,PLLSAI1RoutputFreq_Value,PLLSAI2PoutputFreq_Value,PLLSAI2RoutputFreq_Value,PLLSourceVirtual,PWRFreq_Value,RNGFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMCFreq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAI1OutputFreq_Value,VCOSAI2OutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L496Z(E-G)Tx
RCC.LPTIM2Freq_Value=52000000
Mcu.Pin26=PD7
Mcu.Pin27=PB3 (JTDO/TRACESWO)
PA2.Signal=QUADSPI_BK1_NCS
Mcu.Pin24=PA13 (JTMS/SWDIO)
ProjectManager.UnderRoot=true
Mcu.Pin25=PA14 (JTCK/SWCLK)
Mcu.IP8=SPI1
Mcu.IP9=SYS
Mcu.Pin28=PB5
Mcu.IP6=QUADSPI
Mcu.Pin29=PB6
Mcu.IP7=RCC
ProjectManager.CoupleFile=false
PA4.Signal=GPIO_Output
ADC1.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
RCC.SYSCLKFreq_VALUE=52000000
PB5.Signal=CAN2_RX
Mcu.Pin22=PA7
Mcu.Pin23=PC4
PA1.Locked=true
Mcu.Pin20=PA5
ADC1.master=1
Mcu.Pin21=PA6
PA3.Locked=true
ADC2.NbrOfConversionFlag=1
NVIC.ForceEnableDMAVector=true
RCC.PLLSAI2PoutputFreq_Value=52000000
KeepUserPlacement=false
PC14-OSC32_IN\ (PC14).Signal=RCC_OSC32_IN
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
ADC1.Rank-1\#ChannelRegularConversion=1
ProjectManager.HeapSize=0x200
Mcu.Pin15=PA0
PA0.GPIOParameters=GPIO_Label
PF0.Mode=I2C
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PA1
Mcu.Pin13=PC2
PF8.Locked=true
Mcu.Pin14=PC3
Mcu.Pin19=PA4
PF6.Mode=Single Bank 1
ProjectManager.ComputerToolchain=false
PF9.Signal=QUADSPI_BK1_IO1
Mcu.Pin17=PA2
RCC.HSI_VALUE=16000000
Mcu.Pin18=PA3
PC14-OSC32_IN\ (PC14).GPIOParameters=GPIO_Label
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
PH0-OSC_IN\ (PH0).GPIO_Label=OSC_IN
Mcu.Pin11=PC0
Mcu.Pin12=PC1
RCC.PLLM=2
PB3\ (JTDO/TRACESWO).Mode=Trace_Asynchronous_SW
PB8.Mode=CAN_Activate
Mcu.Pin10=PH1-OSC_OUT (PH1)
ADC2.Rank-1\#ChannelRegularConversion=1
PA2.Mode=Single Bank 1
PB8.Signal=CAN1_RX
PC3.GPIO_Label=EF1_CUR
RCC.PWRFreq_Value=52000000
RCC.I2C2Freq_Value=52000000
RCC.APB1Freq_Value=52000000
ADC1.ClockPrescaler=ADC_CLOCK_ASYNC_DIV4
PC0.Locked=true
ProjectManager.DeviceId=STM32L496ZGTx
PC1.Signal=GPIO_Output
PD7.GPIOParameters=GPIO_Label
ProjectManager.LibraryCopy=1
PA13\ (JTMS/SWDIO).Signal=SYS_JTMS-SWDIO
PA3.GPIO_Label=SPI1_CS3
PH0-OSC_IN\ (PH0).GPIOParameters=GPIO_Label
PA7.Signal=SPI1_MOSI
PA6.Locked=true
isbadioc=false
